<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"44b0e11c2bdd4506844d3feabb3ce4c7ded31f7d7b7bf06b08faa99d9dfed753","plan_job_ref":"Job Terraform Plan #346 at https://github.com/cal-itp/data-infra/actions/runs/16036227186","plan_out_hash":"6f2b417d6b49caba90ddb7741b54b35126bffd88f068e3cbae45d62f8fa39ca3","plan_hash":"b4aa67fd112f09e9e3562fa7da6bd770325b7129b14ed978f2d410f957588ff5","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/gcs/us__
<details>
<summary>Plan: 2 to add, 1 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket.calitp-reports will be created
+   resource "google_storage_bucket" "calitp-reports" {
+       default_event_based_hold    = false
+       effective_labels            = {
+           "goog-terraform-provisioned" = "true"
        }
+       force_destroy               = true
+       id                          = (known after apply)
+       location                    = "US-WEST2"
+       name                        = "calitp-reports"
+       project                     = "cal-itp-data-infra"
+       project_number              = (known after apply)
+       public_access_prevention    = "inherited"
+       requester_pays              = false
+       rpo                         = (known after apply)
+       self_link                   = (known after apply)
+       storage_class               = "STANDARD"
+       terraform_labels            = {
+           "goog-terraform-provisioned" = "true"
        }
+       time_created                = (known after apply)
+       uniform_bucket_level_access = true
+       updated                     = (known after apply)
+       url                         = (known after apply)

+       soft_delete_policy (known after apply)

+       versioning (known after apply)

+       website {
+           main_page_suffix = "index.html"
        }
    }

  # google_storage_bucket.tfer--rt-parsed-deprecated will be updated in-place
!~  resource "google_storage_bucket" "tfer--rt-parsed-deprecated" {
        id                          = "rt-parsed-deprecated"
        name                        = "rt-parsed-deprecated"
!~      terraform_labels            = {
+           "deprecated" = (known after apply)
        }
#        (16 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # google_storage_bucket_iam_member.calitp-reports will be created
+   resource "google_storage_bucket_iam_member" "calitp-reports" {
+       bucket = "calitp-reports"
+       etag   = (known after apply)
+       id     = (known after apply)
+       member = "allUsers"
+       role   = "roles/storage.objectViewer"
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Changes to Outputs:
+   google_storage_bucket_calitp-reports_name                                                                  = "calitp-reports"
```
</details>

:memo: Plan generated in [Terraform Plan #346](https://github.com/cal-itp/data-infra/actions/runs/16036227186)